<?php
/***************************************************************************
*                                                                          *
*   (c) 2004 Vladimir V. Kalynyak, Alexey V. Vinokurov, Ilya M. Shalnev    *
*                                                                          *
* This  is  commercial  software,  only  users  who have purchased a valid *
* license  and  accept  to the terms of the  License Agreement can install *
* and use this program.                                                    *
*                                                                          *
****************************************************************************
* PLEASE READ THE FULL TEXT  OF THE SOFTWARE  LICENSE   AGREEMENT  IN  THE *
* "copyright.txt" FILE PROVIDED WITH THIS DISTRIBUTION PACKAGE.            *
****************************************************************************/

$vi = array(
    'а'=>'a', 'А'=>'a', 
    'á'=>'a', 'Á'=>'a', 
    'à'=>'a', 'À'=>'a', 
    'ả'=>'a', 'Ả'=>'a', 
    'ã'=>'a', 'Ã'=>'a', 
    'ạ'=>'a', 'Ạ'=>'a', 

    'ă'=>'a', 'Ă'=>'a', 
    'ắ'=>'a', 'Ắ'=>'a', 
    'ằ'=>'a', 'Ằ'=>'a',
    'ẳ'=>'a', 'Ẳ'=>'a', 
    'ẵ'=>'a', 'Ẵ'=>'a', 
    'ặ'=>'a', 'Ặ'=>'a', 

    'â'=>'a', 'Â'=>'a', 
    'ấ'=>'a', 'Ấ'=>'a', 
    'ầ'=>'a', 'Ầ'=>'a', 
    'ẩ'=>'a', 'Ẩ'=>'a', 
    'ẫ'=>'a', 'Ẫ'=>'a', 
    'ậ'=>'a', 'Ậ'=>'a', 

    'đ'=>'d', 'Đ'=>'d',
    
    'е'=>'e', 'Е'=>'e',
    'é'=>'e', 'É'=>'e', 
    'è'=>'e', 'È'=>'e', 
    'ẻ'=>'e', 'Ẻ'=>'e', 
    'ẽ'=>'e', 'Ẽ'=>'e', 
    'ẹ'=>'e', 'Ẹ'=>'e',

    'ê'=>'e', 'Ê'=>'e', 
    'ế'=>'e', 'Ế'=>'e', 
    'ề'=>'e', 'Ề'=>'e', 
    'ể'=>'e', 'Ể'=>'e', 
    'ễ'=>'e', 'Ễ'=>'e', 
    'ệ'=>'e', 'Ệ'=>'e',

    'i'=>'i', 'I'=>'i',
    'í'=>'i', 'Í'=>'i', 
    'ì'=>'i', 'Ì'=>'i', 
    'ỉ'=>'i', 'Ỉ'=>'i', 
    'ĩ'=>'i', 'Ĩ'=>'i', 
    'ị'=>'i', 'Ị'=>'i',

    'y'=>'y', 'Y'=>'y',
    'ý'=>'y', 'Ý'=>'y', 
    'ỳ'=>'y', 'Ỳ'=>'y', 
    'ỷ'=>'y', 'Ỷ'=>'y', 
    'ỹ'=>'y', 'Ỹ'=>'y', 
    'ỵ'=>'y', 'Ỵ'=>'y',

    'о'=>'o', 'О'=>'o',
    'ó'=>'o', 'Ó'=>'o',
    'ò'=>'o', 'Ò'=>'o',
    'ỏ'=>'o', 'Ỏ'=>'o',
    'õ'=>'o', 'Õ'=>'o',
    'ọ'=>'o', 'Ọ'=>'o',

    'ơ'=>'o', 'Ơ'=>'o',
    'ớ'=>'o', 'Ớ'=>'o',
    'ờ'=>'o', 'Ờ'=>'o',
    'ở'=>'o', 'Ở'=>'o',
    'ỡ'=>'o', 'Ỡ'=>'o',
    'ợ'=>'o', 'Ợ'=>'o',

    'ô'=>'o', 'Ô'=>'o',
    'ố'=>'o', 'Ố'=>'o',
    'ồ'=>'o', 'Ồ'=>'o',
    'ổ'=>'o', 'Ổ'=>'o',
    'ỗ'=>'o', 'Ỗ'=>'o',
    'ộ'=>'o', 'Ộ'=>'o',

    'u'=>'u', 'U'=>'u',
    'ú'=>'u', 'Ú'=>'u',
    'ù'=>'u', 'Ù'=>'u',
    'ủ'=>'u', 'Ủ'=>'u',
    'ũ'=>'u', 'Ũ'=>'u',
    'ụ'=>'u', 'Ụ'=>'u',

    'ư'=>'u', 'Ư'=>'u',
    'ứ'=>'u', 'Ứ'=>'u',
    'ừ'=>'u', 'Ừ'=>'u',
    'ử'=>'u', 'Ử'=>'u',
    'ữ'=>'u', 'Ữ'=>'u',
    'ự'=>'u', 'Ự'=>'u'
);

return array_merge($schema, $vi);
